[
  {
    "url": "https://economictimes.indiatimes.com/markets/candlestick-screener",
    "timestamp": "2025-03-25T16:23:47.761715",
    "content": [
      {
        "main_content": [
          "BenchmarksNifty23,668.6510.31BenchmarksclosedNifty23,668.6510.31FEATURED",
          "FUNDS★★★★★HSBC Large Cap Fund Direct-Growth5Y Return25.24 %Invest NowFEATURED",
          "FUNDS★★★★★Canara Robeco ELSS Tax Saver Regular - Growth5Y Return26.49 %Invest",
          "NowEnter search text:English EditionEnglish",
          "Editionहिन्दीગુજરાતીमराठीবাংলাಕನ್ನಡമലയാളംதமிழ்తెలుగు|25 March, 2025, 04:16 PM",
          "IST|Today's ePaperMy WatchlistSubscribeSign InHomeETPrimeMarketsMarket",
          "DataNewsIndustryAI",
          "MasterclassSMEPoliticsWealthMFTechAICareersOpinionNRIPanacheMore",
          "MenuStocksNewsLive BlogStock Live BlogEarningsPodcastMarket ClassroomDons of",
          "Dalal StreetRecosStock Reports PlusNewMy ScreenerCandlestick ScreenerStock",
          "ScreenerStock WatchMarket CalendarStock Price QuotesOptionsIPOs/FPOsExpert",
          "ViewsInvestment IdeasCommoditiesViewsNewsOthersMentha OilPrecious MetalsGold",
          "MGoldSilverGold PetalSilver MicroSilver MGold GuineaOil & EnergyNatural GasCrude",
          "OilCrude Oil MiniBase MetalsAluminiumZinc MiniLead MiniCopperZincNickelAluminium",
          "MiniLeadPlantationKapasCotton CandyForexForex NewsCurrency ConverterLive",
          "Stream!Basics of crypto and blockchainAIF PMSCryptocurrencyCrypto NewsCrypto",
          "TVCrypto Returns CalculatorCrypto PricesAll CryptosMoreTechnicalsTechnical",
          "ChartVisualizeScreenerMind Over MoneyWeb StoriesMarkets DataUnlisted",
          "CompaniesMarket MogulsBondsWebinarsSitemapDefinitionsBusiness",
          "News›Markets›Stocks›Candlestick ScreenerCandlestick ScreenerDiscover and screen",
          "trade opportunitiesFundamental ScreenersCandlestick ScreenersTop Trending",
          "ScreenersBullish ScreenersWhite Marubozu(s)10 STOCKSLong White Candle8",
          "STOCKSBullish Strong Line5 STOCKSHammer0 STOCKSInverted Hammer0 STOCKSBullish",
          "Belt Hold0 STOCKSBullish Engulfing0 STOCKSBullish Harami0 STOCKSBullish Doji",
          "Star0 STOCKSBullish Harami Cross0 STOCKSMorning Star0 STOCKSMorning Doji Star0",
          "STOCKSBullish Abandoned Baby0 STOCKSBearish ScreenersBlack Marubozu(s)5",
          "STOCKSLong Black Candle2 STOCKSBearish Strong Line2 STOCKSOne Candle Shooting",
          "Star2 STOCKSHanging Man0 STOCKSBearish Belt Hold0 STOCKSBearish Engulfing0",
          "STOCKSBearish doji star0 STOCKSBearish Harami0 STOCKSDark Cover Cloud0",
          "STOCKSBearish Harami Cross0 STOCKSEvening Star0 STOCKSEvening Doji Star0",
          "STOCKSBearish Abandoned Baby0 STOCKSNeutral ScreenersWhite Spinning Top50",
          "STOCKSBlack Spinning Top47 STOCKSFour Price Doji0 STOCKSDoji0 STOCKSWondering",
          "which stocks may witness action tomorrow? Looking for stocks where bearish",
          "trends might be over soon, or bullish trend might be under threat? Candlestick",
          "screener identifies candle formation for you to answer these. (Fun fact:",
          "Candlesticks were first used in 16th century by Japanese rice traders, reliable",
          "and handy even in 2020).For traders, learning & identifying bullish or bearish",
          "candlestick formation in a maze of listed stocks is a painstaking activity. ET’s",
          "Candlestick screener is designed to help traders identify stocks where",
          "candlestick formation is indicating that bears currently have control, but the",
          "underlying indications are signalling that the bulls will be back soon in just a",
          "click. Also, candlestick scanner can help find stocks where the bulls are ruling",
          "the roost, but the bears are quietly making a move.While some of these candle",
          "formations are fairly accurate & can help traders quickly spot a trend reversal,",
          "there are other candle formations which can only help figure out when an ongoing",
          "trend has paused and when it is about resume. Some of these Japanese",
          "candlesticks also help in spotting stocks which are going through a phase of",
          "confusion but might end in favour of bulls OR bears. Hope you enjoy this",
          "screener. Plan well and trade better!Top Candlestick ScreenersNSEBSENEUTRALWhite",
          "Spinning TopThe essential element of a simple and classic doji candle is opening",
          "and closing price.Blue Dart Express Ltd.6516.258.50%Kalpataru Projects",
          "International Ltd.1016.93.73%Ceat Ltd.2911.41.90%47MORE STOCKSNEUTRALBlack",
          "Spinning TopThe essential element of a simple and classic doji candle is opening",
          "and closing price.Graphite India Ltd.495.97.79%Garware Technical Fibres",
          "Ltd.836.752.24%Firstsource Solutions Ltd.327.92.23%44MORE STOCKSBULLISHWhite",
          "Marubozu(s)The essential element of a simple and classic doji candle is opening",
          "and closing price.Indegene Ltd.560.81.59%Honasa Consumer Ltd.238.361.48%Indian",
          "Renewable Energy Development Agency Ltd.169.95-.06%7MORE STOCKSBULLISHLong White",
          "CandleThe essential element of a simple and classic doji candle is opening and",
          "closing price.Jubilant Foodworks Ltd.668.251.55%Chalet Hotels",
          "Ltd.866.7.29%Indian Renewable Energy Development Agency Ltd.169.95-.06%5MORE",
          "STOCKSBEARISHBlack Marubozu(s)The essential element of a simple and classic doji",
          "candle is opening and closing price.CreditAccess Grameen",
          "Ltd.966.95-2.91%Vodafone Idea Ltd.7.15-2.59%Shyam Metalics And Energy",
          "Ltd.854.4-1.07%2MORE STOCKSBULLISHBullish Strong LineThe essential element of a",
          "simple and classic doji candle is opening and closing price.Indegene",
          "Ltd.560.81.59%Chalet Hotels Ltd.866.7.29%Federal Bank Ltd.194.85-.49%2MORE",
          "STOCKSLoad More...20of79SCREENERS SHOWN0Stocks FoundNSEBSEExplore More...Load",
          "More...20of79STOCKS SHOWNDISCLAIMER: This tools/analysis is provided to you only",
          "for convenience. Any output of such tools/analysis is for informational purposes",
          "only and should not be relied upon or construed as an investment advice or",
          "guarantee for any specific performance/returns. Before relying on such output,",
          "please consult your advisor before taking any decision.Trending in MarketsSensex",
          "TodayStocks in NewsStocks to BuyPolycab Stock PriceGarden Reach Shipbuilders",
          "Share PriceMobiKwik Share PriceIndusInd Bank SharesWhy IndusInd Bank Share is",
          "Falling?Pi Coin Price PredictionHexaware Technologies Share PriceNykaa Q3",
          "ResultsVA Tech Wabag ShareLIC Q3 ResultsSBI share priceBharti Airtel Share",
          "PriceReliance Power Stock PriceSwiggy Stock PriceSwiggy Results 2025Gold Price",
          "TodayVishal Mega Mart Share PriceONGC Share PriceITC Shares PriceBudget day",
          "trading strategyAdani Enterprises Q3 Results 2025Adani Ports Share PriceBajaj",
          "Finserv Share PriceWhirlpool India Share PriceTata Motors Stock PriceKPIT Share",
          "PriceMarkets Trending TermsNSENifty PharmaBSEAxis Bank Share PricePNB Share",
          "PriceCrude OilICICI Bank Share PriceStocks in NewsForexInfosys Share PriceCopper",
          "RateClose XAdd this company to your WatchlistSelect WatchlistCreate New",
          "WatchListView WatchlistEnter search",
          "text:BrowseCompanies:ABCDEFGHIJKLMNOPQRSTUVWXYZ123456789Quick LinksMOREMobiKwik",
          "Shares NewsReliance Power Preferential IssueHDB Financial Services IPOWestern",
          "Carriers IPO Allotment StatusITD Cementation Share PriceUS Fed Meeting",
          "TimeReliance Power Share PriceGST Council Meeting LiveBaazar Style Retail IPOHAL",
          "Share PriceNiftyShare Market LiveBajaj Housing Finance Share PriceTCS Q4",
          "ResultsAdani Green Q2 ResultsMaruti Suzuki Q2 ResultsCipla Q2 ResultsMamaearth",
          "IPONestle India Q3 ResultsHot on WebMOREIPL Ticket BookingGRSE Share PriceSensex",
          "TodayStocks in NewsWWE Raw Live StreamingWhere to Watch Delhi Capitals vs",
          "Lucknow Match LiveDC vs LSG Pitch ReportDC vs LSG Playing 11DC vs LSG Head to",
          "HeadBank Strike TodayWorld TB DayGRSE Share PriceNCC Share PriceVanessa TrumpRPF",
          "Constable RecruitmentIPL 2025 Opening Ceremony Live UpdatesSRH VS RR Live",
          "ScoreIn Case you missed itMOREStock Market LIVEAfcons InfrastructureIREDA Q2",
          "ResultsReliance Power Preferential IssueManba Finance IPOHDB Financial Services",
          "IPOCochin Shipyard Share PriceNorthern Arc Capital IPO AllotmentArkade",
          "Developers IPO Allotment TodayStocks in news todayUS Fed Meeting TimeUS Fed Rate",
          "Cut TodayNSE Bonus Issue Record DateBSE Share PriceBajaj Housing Finance IPO",
          "Listing LiveBajaj Housing Finance Share PriceTata Power Share PriceMORETop",
          "Searched CompaniesIRFC share priceSuzlon share priceIREDA share priceTATA Motors",
          "share priceYes bank share priceHDFC Bank share priceNHPC share priceRVNL share",
          "priceSBI share priceTata power share priceTata steel share priceAdani power",
          "share pricePaytm share pricePNB share priceZomato share priceBEL share priceBHEL",
          "share priceInfosys share priceIRCTC share priceITC share priceJIO finance share",
          "priceLIC share priceReliance share priceHAL share priceJP Power share priceNBCC",
          "share priceTCS share priceVedanta share priceWipro share priceIOC share",
          "priceIrcon share priceSAIL share priceSJVN share priceGAIL share priceHUDCO",
          "share priceREC share priceReliance Power share priceTata Technologies share",
          "priceVodafone idea share priceAdani Enterprises share priceAdani Green share",
          "priceAdani Port share priceAshok Leyland share priceBank of Baroda share",
          "priceBSE share priceCanara Bank share priceCDSL share priceCoal India share",
          "priceHFCL share priceIDFC First Bank share priceTop CalculatorsMOREStandard",
          "Deviation CalculatorIncome Tax CalculatorAge CalculatorSIP CalculatorTime",
          "CalculatorBMI CalculatorGPA CalculatorStatistics CalculatorFraction",
          "CalculatorDiabetes Risk CalculatorDate CalculatorLog CalculatorMORETop",
          "CommoditiesGold RateMenthaoil RateNickel RateKapas RateCopper RateZinc",
          "RateSilver RateCotton RateAluminium RateCrudeoil RateMORETop Prime ArticlesNo 5g",
          "Service Lack Of Fresh Funds Could Further Hurt Vodafone Idea Even As Airtel Jio",
          "Leap AheadFalling Off The Momentum Why Retail Investors Are Losing Money After",
          "Witnessing A Long RallyIs Nifty Next 50 A Good Bet Only If You Are A Super Long",
          "Term InvestorAdani Group Stocks Will Averaging Out Work For Retail InvestorsWe",
          "Want To Solve The Wazirx Binance Issue Once And For All Nischal ShettyReliance",
          "Jiocinema Is Streaming Ipl 2023 For Free Will This Now Disrupt The Ott",
          "BusinessNippon India  Fund DirectAfter Adani Stocks Hindenburg May Have Crashed",
          "Into Indias Green Hydrogen Mission TooIndian It Companies Rode The Cloud Wave As",
          "Hyperscalers Growth Tapers How Will It Impact ThemMens Underwear Sales Are",
          "Falling Should Indian Economy Prepare For A Below The Belt JoltMORETop Story",
          "ListingSgx NiftyDangalLicEarthquake TodayEpfo PensionEarthquake In DelhiTcs",
          "LayoffsNifty CrashStock Market CrashEpfoMORETop DefinitionsAccountingCurrency",
          "SymbolMarketsMarketing MixProductMapsko Builders Private",
          "LimitedFpoBusinessFiscal DeficitRepo RateMORETop SlideshowHow Rajendra Badwe Is",
          "Making Cancer Treatment Affordable By Repurposing Easily Available DrugsIcici",
          "BankAxis BankStock IdeasRaw VegetablesMORETop Market PagesFully Drawn",
          "AdvanceLatest NewsSMFG India Credit raises $175 million via ECB from Standard",
          "Chartered Bank & CTBC BankFor Musk's Starlink, India approval could unlock",
          "emerging marketsGT vs PBKS Pitch Report: How will the surface at Narendra Modi",
          "Stadium in Ahmedabad play for today's match'This is not Indian Idol': Neha",
          "Kakkar's video of crying on stage goes viral as upset fans criticise her for",
          "three-hour delay in MelbourneLok Sabha passes Finance Bill, 2025 after including",
          "35 government amendmentsORIX Corporation India secures Rs 300 crore investment",
          "from Japanese parent firmRupee's winning streak halts as importers step in,",
          "Asian peers slipWith $107 billion revenue in 2024, and sales of 4.3 million",
          "vehicles, Chinese EV maker BYD roars past Tesla'Hum Honge Kangal Ek Din': Kunal",
          "Kamra releases new satirical video taking a dig at Shiv Sena protestorsShare",
          "market update: Most active stocks of the day in terms of traded valueDelhi",
          "traffic police targets top three traffic violators with over 2000 pending",
          "challansChina's DeepSeek releases AI model upgrade, intensifies rivalry with",
          "OpenAIElon Musk dons new MAGA hat with greatest message for Trump at cabinet",
          "meet. President calls him 'patriot'Stock market update: Mining stocks down as",
          "market risesMamaearth’s Ghazal Alagh shares key leadership lessons; reveals the",
          "biggest mistake leaders makeFollow us on:Download ET App:subscribe to our",
          "newsletterCopyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For",
          "reprint rights:Times Syndication Service"
        ]
      }
    ]
  }
]