[
  {
    "url": "https://economictimes.indiatimes.com/markets/ipo",
    "timestamp": "2025-03-25T16:23:58.250281",
    "content": [
      {
        "main_content": [
          "BenchmarksNifty23,668.6510.31BenchmarksclosedNifty23,668.6510.31FEATURED",
          "FUNDS★★★★★HSBC Large Cap Fund Direct-Growth5Y Return25.24 %Invest NowFEATURED",
          "FUNDS★★★★★Canara Robeco ELSS Tax Saver Regular - Growth5Y Return26.49 %Invest",
          "NowEnter search text:English EditionEnglish",
          "Editionहिन्दीગુજરાતીमराठीবাংলাಕನ್ನಡമലയാളംதமிழ்తెలుగు|25 March, 2025, 04:22 PM",
          "IST|Today's ePaperMy WatchlistSubscribeSign InHomeETPrimeMarketsMarket",
          "DataNewsIndustryAI",
          "MasterclassSMEPoliticsWealthMFTechAICareersOpinionNRIPanacheMore",
          "MenuStocksNewsLive BlogStock Live BlogEarningsPodcastMarket ClassroomDons of",
          "Dalal StreetRecosStock Reports PlusNewMy ScreenerCandlestick ScreenerStock",
          "ScreenerStock WatchMarket CalendarStock Price QuotesOptionsIPOs/FPOsExpert",
          "ViewsInvestment IdeasCommoditiesViewsNewsOthersMentha OilPrecious MetalsGold",
          "MGoldSilverGold PetalSilver MicroSilver MGold GuineaOil & EnergyNatural GasCrude",
          "OilCrude Oil MiniBase MetalsAluminiumZinc MiniLead MiniCopperZincNickelAluminium",
          "MiniLeadPlantationKapasCotton CandyForexForex NewsCurrency ConverterLive",
          "Stream!Basics of crypto and blockchainAIF PMSCryptocurrencyCrypto NewsCrypto",
          "TVCrypto Returns CalculatorCrypto PricesAll CryptosMoreTechnicalsTechnical",
          "ChartVisualizeScreenerMind Over MoneyWeb StoriesMarkets DataUnlisted",
          "CompaniesMarket MogulsBondsWebinarsSitemapDefinitionsBusiness",
          "News›Markets›IPOs/FPOsTop Searches:Stock Market Today LiveStocks to Buy TodayKEI",
          "share priceGRSE Share PriceInfosys share priceWhy Indusind Bank is",
          "Falling?Stocks to BuyCoal India Share PricePolycab Stock PricePi NetworkListing",
          "TodayHexaware Technologies Share Price LiveZen Technologies Share PriceIPO",
          "News25 Mar, 2025, 03:08PM IST, ETMarkets.comShri Ahimsa Naturals IPO subscribed",
          "31% so far on Day 1: Check GMP, price band and other detailsShri Ahimsa Naturals",
          "IPO: On the first day of bidding, the retail portion of the issue was subscribed",
          "41%, while the non-institutional investors category saw a 46% subscription.",
          "Meanwhile, qualified institutional buyers had not placed any bids yet.Zepto in",
          "talks for $250 million secondary sale ahead of IPO25 Mar, 2025, 09:11AM IST,",
          "BloombergATC Energies System IPO to open for subscription today. Check issue",
          "price, GMP, other details25 Mar, 2025, 07:44AM IST, ETMarkets.comShri Ahimsa",
          "Naturals IPO to open for subscription today. Check issue price, GMP, other",
          "details25 Mar, 2025, 07:42AM IST, ETMarkets.comESDS Software to file DRHP this",
          "week to raise upto Rs 700 crore through IPO23 Mar, 2025, 07:42PM IST, ET",
          "BureauFour new SME IPOs, five listings lined up for this week. Check details23",
          "Mar, 2025, 12:12PM IST, ETMarkets.com22 Mar, 2025, 12:24PM IST, ETMarkets.comATC",
          "Energies Rs 63.76 cr IPO opens for public subscription on March 25. Check GMP,",
          "other detailsATC Energies System will launch its IPO on March 25, aiming to",
          "raise Rs 63.76 crore. The IPO includes 54,03,600 equity shares, and the proceeds",
          "will be used for debt repayment, capital expenditure, IT infrastructure",
          "upgrades, and working capital requirements. Shares are priced between Rs 112 and",
          "Rs 118 each.SSF Plastics files DRHP with Sebi, plans to r...21 Mar, 2025,",
          "02:48PM IST, ETMarkets.comPhysicsWallah files draft IPO papers with Seb...21",
          "Mar, 2025, 01:13PM IST, PTIRapid Fleet Management IPO: Check key dates, ...21",
          "Mar, 2025, 08:02AM IST, ETMarkets.comActive Infrastructures IPO: Check key",
          "dates, ...21 Mar, 2025, 07:53AM IST, ETMarkets.comParadeep Parivahan IPO: Check",
          "allotment statu...20 Mar, 2025, 07:53AM IST, ETMarkets.comMore FromIPO",
          "News»IPOOpenUpcomingListing SoonListedIPO NAMEISSUE TYPEOffer Price/RangeOPENING",
          "DATECLOSING DATEISSUE SIZEActive Infrastructures",
          "Ltd.IPO178-18121-03-202525-03-202577.83 CrRapid Fleet Management Services",
          "Ltd.IPO183-19221-03-202525-03-202543.87 CrDesco Infratech",
          "Ltd.IPO147-15024-03-202526-03-202530.75 CrShri Ahimsa Naturals",
          "Ltd.OFS113-11925-03-202527-03-202573.81 CrATC Energies System",
          "Ltd.OFS112-11825-03-202527-03-202563.76 CrIPO Classroom3 Jul 2018, 14:43,",
          "ThinkStock PhotosIPO play: Look out for these blind spotsIf a public offer is",
          "oversubscribed, it's a must buy, right? But there is every probability that you",
          "may be wide of the mark. The thumbrule doesn't ho...Wanna jump into IPO rush?",
          "Here is how to maxi...6 Mar 2017, 15:47, ETMarkets.comBitter IPO truth: Big",
          "subscription no guarant...6 May 2016, 16:36, ET OnlineChasing IPOs? Beware! Big",
          "listing gains may m...13 Jul 2016, 13:25, ET OnlineJoining the IPO rush? Here’s",
          "how the Asba pro...19 Jun 2017, 11:52, ETMarkets.comIndia’s IPO mart has",
          "changed; what hasn’t is ...28 Jun 2017, 13:08, ET CONTRIBUTORSFive IPOs that",
          "shook up and shaped D-St senti...7 Mar 2017, 09:48, ETMarkets.comET in the",
          "classroom: The process of filing fo...13 May 2016, 06:55, ET BureauHow to run a",
          "litmus test for IPOs14 Sep 2016, 07:57, ET BureauMore from IPO Classroom",
          "»Recently Listed IPOsALLTOPBOTTOMTOP ON LISTING DAYBOTTOM ON LISTING DAYNAME OF",
          "IPOCLOSE DATELISTING DATEOFFER PRICECURRENT PRICECHANGE ABS %HOLDING",
          "PERIODLISTING PRICE CHANGE %Divine Hira Jewellers",
          "Ltd.19-03-202524-03-202590.0081.254.9729.72Balaji Phosphates",
          "Ltd.04-03-202507-03-202570.0091.1012.261921.47HP Telecom India",
          "Ltd.24-02-202528-02-2025108.00109.002.68265.26Royal Arc Electrodes",
          "Ltd.18-02-202524-02-2025120.00127.950.58306.63Quality Power Electrical",
          "Equipments Ltd.18-02-202524-02-2025425.00335.150.033022.06Tejas Cargo India",
          "Ltd.18-02-202524-02-2025168.00168.000.00304.00P S Raj Steels",
          "Ltd.14-02-202519-02-2025140.00139.750.00353.62Voler Car",
          "Ltd.14-02-202519-02-202590.0085.601.90354.89Maxvolt Energy Industries",
          "Ltd.14-02-202519-02-2025180.00170.300.61355.39Hexaware Technologies",
          "Ltd.14-02-202519-02-2025708.00725.001.12352.75» More from Listed IPOsLatest",
          "Markets Videos▹Two Sharp with ET: How India plans to tackle Trump’s tariff",
          "threat & M▹Stock Radar | Why does it make sense to accumulate HDFC Bank at",
          "curren▹Two Sharp with ET: Is India giving up on PLI? Why Birla, Adani & JSW",
          "aRecommendations1234+25 Mar 2025, 10:11 HRS ISTbuyCoal India Ltd.CURRENT",
          "PRICEbuy407.6buy+25 Mar 2025, 09:51 HRS ISTbuyBharat Heavy Electricals",
          "Ltd.CURRENT PRICEbuy214.75buy+25 Mar 2025, 09:31 HRS ISTbuyBharat Electronics",
          "Ltd.CURRENT PRICEbuy299.7buy+25 Mar 2025, 09:11 HRS ISTreduceGreenpanel",
          "Industries Ltd.CURRENT PRICEreduce235.1reduce+25 Mar 2025, 08:51 HRS",
          "ISTaddKalyan Jewellers India Ltd.CURRENT PRICEadd475add+24 Mar 2025, 10:11 HRS",
          "ISTbuyJK Cement Ltd.CURRENT PRICEbuy4824.85buy+24 Mar 2025, 09:51 HRS ISTbuyJSW",
          "Steel Ltd.CURRENT PRICEbuy1058.95buy+24 Mar 2025, 09:31 HRS ISTbuyBajaj Finserv",
          "Ltd.CURRENT PRICEbuy1830.3buy+24 Mar 2025, 09:11 HRS ISTbuyVoltas Ltd.CURRENT",
          "PRICEbuy1442.4buy+24 Mar 2025, 08:51 HRS ISTbuyV-Mart Retail Ltd.CURRENT",
          "PRICEbuy2895.95buy+21 Mar 2025, 10:11 HRS ISTbuyHealthcare Global Enterprises",
          "Ltd.CURRENT PRICEbuy500.35buy+21 Mar 2025, 09:51 HRS ISTbuyTata Communications",
          "Ltd.CURRENT PRICEbuy1597.65buy+21 Mar 2025, 09:31 HRS ISTbuyPrestige Estates",
          "Projects Ltd.CURRENT PRICEbuy1203.25buy+21 Mar 2025, 09:11 HRS ISTaddPidilite",
          "Industries Ltd.CURRENT PRICEadd2745.85add+21 Mar 2025, 08:51 HRS ISTbuySuzlon",
          "Energy Ltd.CURRENT PRICEbuy58.08buy+20 Mar 2025, 10:11 HRS ISTbuyGrasim",
          "Industries Ltd.CURRENT PRICEbuy2450.55buyTrending in MarketsSensex TodayStocks",
          "in NewsStocks to BuyPolycab Stock PriceGarden Reach Shipbuilders Share",
          "PriceMobiKwik Share PriceIndusInd Bank SharesWhy IndusInd Bank Share is",
          "Falling?Pi Coin Price PredictionHexaware Technologies Share PriceNykaa Q3",
          "ResultsVA Tech Wabag ShareLIC Q3 ResultsSBI share priceBharti Airtel Share",
          "PriceReliance Power Stock PriceSwiggy Stock PriceSwiggy Results 2025Gold Price",
          "TodayVishal Mega Mart Share PriceONGC Share PriceITC Shares PriceBudget day",
          "trading strategyAdani Enterprises Q3 Results 2025Adani Ports Share PriceBajaj",
          "Finserv Share PriceWhirlpool India Share PriceTata Motors Stock PriceKPIT Share",
          "PriceGet a QuoteGet QuoteMarket NowLast ViewedIPOBSENSEStock Market Event",
          "CalendarMore from Stock Market Calendar »Most ReadMost SharedMost CommentedESDS",
          "Software to file DRHP this week to raise upto Rs 700 crore through IPOSebi yet",
          "to clear HDB, Hero FinCorp IPOs; talk of breach of some rulesParadeep Parivahan",
          "IPO: Check allotment status, listing date and other detailsFour new SME IPOs,",
          "five listings lined up for this week. Check detailsParadeep Parivahan IPO",
          "subscribed 95% on Day 3: Check GMP, price band, and other detailsMore »Enter",
          "search text:BrowseCompanies:ABCDEFGHIJKLMNOPQRSTUVWXYZ123456789Quick",
          "LinksMOREMobiKwik Shares NewsReliance Power Preferential IssueHDB Financial",
          "Services IPOWestern Carriers IPO Allotment StatusITD Cementation Share PriceUS",
          "Fed Meeting TimeReliance Power Share PriceGST Council Meeting LiveBaazar Style",
          "Retail IPOHAL Share PriceNiftyShare Market LiveBajaj Housing Finance Share",
          "PriceTCS Q4 ResultsAdani Green Q2 ResultsMaruti Suzuki Q2 ResultsCipla Q2",
          "ResultsMamaearth IPONestle India Q3 ResultsHot on WebMOREIPL Ticket BookingGRSE",
          "Share PriceSensex TodayStocks in NewsWWE Raw Live StreamingWhere to Watch Delhi",
          "Capitals vs Lucknow Match LiveDC vs LSG Pitch ReportDC vs LSG Playing 11DC vs",
          "LSG Head to HeadBank Strike TodayWorld TB DayGRSE Share PriceNCC Share",
          "PriceVanessa TrumpRPF Constable RecruitmentIPL 2025 Opening Ceremony Live",
          "UpdatesSRH VS RR Live ScoreIn Case you missed itMOREStock Market LIVEAfcons",
          "InfrastructureIREDA Q2 ResultsReliance Power Preferential IssueManba Finance",
          "IPOHDB Financial Services IPOCochin Shipyard Share PriceNorthern Arc Capital IPO",
          "AllotmentArkade Developers IPO Allotment TodayStocks in news todayUS Fed Meeting",
          "TimeUS Fed Rate Cut TodayNSE Bonus Issue Record DateBSE Share PriceBajaj Housing",
          "Finance IPO Listing LiveBajaj Housing Finance Share PriceTata Power Share",
          "PriceMORETop Searched CompaniesIRFC share priceSuzlon share priceIREDA share",
          "priceTATA Motors share priceYes bank share priceHDFC Bank share priceNHPC share",
          "priceRVNL share priceSBI share priceTata power share priceTata steel share",
          "priceAdani power share pricePaytm share pricePNB share priceZomato share",
          "priceBEL share priceBHEL share priceInfosys share priceIRCTC share priceITC",
          "share priceJIO finance share priceLIC share priceReliance share priceHAL share",
          "priceJP Power share priceNBCC share priceTCS share priceVedanta share priceWipro",
          "share priceIOC share priceIrcon share priceSAIL share priceSJVN share priceGAIL",
          "share priceHUDCO share priceREC share priceReliance Power share priceTata",
          "Technologies share priceVodafone idea share priceAdani Enterprises share",
          "priceAdani Green share priceAdani Port share priceAshok Leyland share priceBank",
          "of Baroda share priceBSE share priceCanara Bank share priceCDSL share priceCoal",
          "India share priceHFCL share priceIDFC First Bank share priceTop",
          "CalculatorsMOREStandard Deviation CalculatorIncome Tax CalculatorAge",
          "CalculatorSIP CalculatorTime CalculatorBMI CalculatorGPA CalculatorStatistics",
          "CalculatorFraction CalculatorDiabetes Risk CalculatorDate CalculatorLog",
          "CalculatorMORETop CommoditiesGold RateMenthaoil RateNickel RateKapas RateCopper",
          "RateZinc RateSilver RateCotton RateAluminium RateCrudeoil RateMORETop Prime",
          "ArticlesNo 5g Service Lack Of Fresh Funds Could Further Hurt Vodafone Idea Even",
          "As Airtel Jio Leap AheadFalling Off The Momentum Why Retail Investors Are Losing",
          "Money After Witnessing A Long RallyIs Nifty Next 50 A Good Bet Only If You Are A",
          "Super Long Term InvestorAdani Group Stocks Will Averaging Out Work For Retail",
          "InvestorsWe Want To Solve The Wazirx Binance Issue Once And For All Nischal",
          "ShettyReliance Jiocinema Is Streaming Ipl 2023 For Free Will This Now Disrupt",
          "The Ott BusinessNippon India  Fund DirectAfter Adani Stocks Hindenburg May Have",
          "Crashed Into Indias Green Hydrogen Mission TooIndian It Companies Rode The Cloud",
          "Wave As Hyperscalers Growth Tapers How Will It Impact ThemMens Underwear Sales",
          "Are Falling Should Indian Economy Prepare For A Below The Belt JoltMORETop Story",
          "ListingSgx NiftyDangalLicEarthquake TodayEpfo PensionEarthquake In DelhiTcs",
          "LayoffsNifty CrashStock Market CrashEpfoMORETop DefinitionsAccountingCurrency",
          "SymbolMarketsMarketing MixProductMapsko Builders Private",
          "LimitedFpoBusinessFiscal DeficitRepo RateMORETop SlideshowHow Rajendra Badwe Is",
          "Making Cancer Treatment Affordable By Repurposing Easily Available DrugsIcici",
          "BankAxis BankStock IdeasRaw VegetablesMORETop Market PagesFully Drawn",
          "AdvanceLatest NewsSMFG India Credit raises $175 million via ECB from Standard",
          "Chartered Bank & CTBC BankFor Musk's Starlink, India approval could unlock",
          "emerging marketsGT vs PBKS Pitch Report: How will the surface at Narendra Modi",
          "Stadium in Ahmedabad play for today's match'This is not Indian Idol': Neha",
          "Kakkar's video of crying on stage goes viral as upset fans criticise her for",
          "three-hour delay in MelbourneLok Sabha passes Finance Bill, 2025 after including",
          "35 government amendmentsORIX Corporation India secures Rs 300 crore investment",
          "from Japanese parent firmRupee's winning streak halts as importers step in,",
          "Asian peers slipWith $107 billion revenue in 2024, and sales of 4.3 million",
          "vehicles, Chinese EV maker BYD roars past Tesla'Hum Honge Kangal Ek Din': Kunal",
          "Kamra releases new satirical video taking a dig at Shiv Sena protestorsShare",
          "market update: Most active stocks of the day in terms of traded valueDelhi",
          "traffic police targets top three traffic violators with over 2000 pending",
          "challansChina's DeepSeek releases AI model upgrade, intensifies rivalry with",
          "OpenAIElon Musk dons new MAGA hat with greatest message for Trump at cabinet",
          "meet. President calls him 'patriot'Stock market update: Mining stocks down as",
          "market risesMamaearth’s Ghazal Alagh shares key leadership lessons; reveals the",
          "biggest mistake leaders makeFollow us on:Download ET App:subscribe to our",
          "newsletterCopyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For",
          "reprint rights:Times Syndication Service"
        ]
      }
    ]
  }
]