[
  {
    "url": "https://economictimes.indiatimes.com/markets",
    "timestamp": "2025-03-25T16:23:42.719394",
    "content": [
      {
        "main_content": [
          "English EditionEnglish Editionहिन्दीગુજરાતીमराठीবাংলাಕನ್ನಡമലയാളംதமிழ்తెలుగు|25",
          "March, 2025, 04:22 PM IST|Today's ePaperMy WatchlistSubscribeSign",
          "InSearch+HomeETPrimeMarketsMarket DataNewsIndustryAI",
          "MasterclassSMEPoliticsWealthMFTechAICareersOpinionNRIPanacheMore",
          "MenuStocksNewsLive BlogStock Live BlogEarningsPodcastMarket ClassroomDons of",
          "Dalal StreetRecosStock Reports PlusNewMy ScreenerCandlestick ScreenerStock",
          "ScreenerStock WatchMarket CalendarStock Price QuotesOptionsIPOs/FPOsExpert",
          "ViewsInvestment IdeasCommoditiesViewsNewsOthersMentha OilPrecious MetalsGold",
          "MGoldSilverGold PetalSilver MicroSilver MGold GuineaOil & EnergyNatural GasCrude",
          "OilCrude Oil MiniBase MetalsAluminiumZinc MiniLead MiniCopperZincNickelAluminium",
          "MiniLeadPlantationKapasCotton CandyForexForex NewsCurrency ConverterLive",
          "Stream!Basics of crypto and blockchainAIF PMSCryptocurrencyCrypto NewsCrypto",
          "TVCrypto Returns CalculatorCrypto PricesAll CryptosMoreTechnicalsTechnical",
          "ChartVisualizeScreenerMind Over MoneyWeb StoriesMarkets DataUnlisted",
          "CompaniesMarket MogulsBondsWebinarsSitemapDefinitionsBusiness",
          "News›MarketsCLOSED-04:15 PM | Mar 25, 202504:15 PM | Mar 25,",
          "2025Sensex78,017.1932.81(0.04%)Nifty23,668.6510.31(0.04%)1D1W1M3M6M1Y5YCreated",
          "with Highcharts 10.3.309:1412:2215:3123,60023,80024,000Prev.",
          "Close:23,658.35IndicesCryptocurrencyNifty Midcap 10051,969.75(-1.06%)BSE",
          "SmallCap47,070.40(-1.63%)Nifty IT37,706.90(1.32%)Nifty",
          "Bank51,607.95(-0.19%)IndicesBitcoin Price74,76,943(-0.48%)Ethereum",
          "Price1,77,841(-0.86%)Tether Price85.72(0.14%)XRP Price210(-1.04%)MORETop",
          "GainersTop LosersHEG483.00(11.88%)Blue Dart6,516.25(8.50%)Graphite",
          "India495.90(7.79%)PTC Industries14,512.95(4.62%)* NSE 500GainersDixon",
          "Tech13,624.50(-6.74%)Swan Energy444.25(-6.05%)Zomato209.81(-5.84%)Himadri",
          "Speciality432.85(-5.51%)* NSE 500LosersGold87,753.00475.00",
          "(0.54%)USD/INR85.720.07 (0.08%)STOCK SEARCHClosing BellSensex ends marginally",
          "higher, Nifty holds 23,650; Zomato cracks 6%, IndusInd Bank 5%VideosStock Radar",
          "| Why does it make sense to accumulate HDFC Bank at current levels? Ajit Mishra",
          "decodesStock Radar: Zomato stock is showing signs of base formation; is it time",
          "to buy?Why is Hindustan Aeronautics looking attractive on charts after a double-",
          "digit fall from highs?Why is Som Distilleries looking like a good buy on dips",
          "stock? Shitij Gandhi decodesBajaj Finance is on the verge of a breakout from an",
          "upward sloping channel; is it time to buy?Why is Paytm a good buy on dips stock?",
          "Kkunal V. Parar explainsAvanti Feeds hit a fresh multi-year high in February; is",
          "it time to buy?Stock Radar | Why is Jindal Saw looking attractive on charts",
          "after steel decline?FII rush out, Sensex swings; is it a matter of concern?Why",
          "does InterGlobe Aviation look attractive on charts?1234567891015 Minutes",
          "agoGainers & Losers: IndusInd Bank, HEG Ltd among 11 stocks that hogged",
          "limelight today33 Minutes agoRupee's winning streak halts as importers step in,",
          "Asian peers slip37 Minutes agoMarket Wrap: D-Street ends flat as RIL, ICICI Bank",
          "offset IT gains; Sensex adds 32 pts, Nifty holds 23,6501 Hour agoATC Energies",
          "System IPO subscribed 33% so far on Day 1: Check GMP, price band and other",
          "details1 Hour agoShri Ahimsa Naturals IPO subscribed 31% so far on Day 1: Check",
          "GMP, price band and other details1 Hour agoThis will be a year of largecaps and",
          "quality stocks; India’s big story is consumption: Nimesh Chandan1 Hour agoStocks",
          "to Buy | Market volatility & SIPs: Dinshaw Irani’s advice for retail investors2",
          "Hours agoThese 10 stocks delivered over 30% gains in just 6 sessions2 Hours",
          "agoSBI Card, Shree Cement among 4 large and mid-cap stocks that hit 52-week",
          "highs on Tuesday2 Hours agoIndia’s stock market rebound is blowing past",
          "technical barriers2 Hours agoEuropean shares rise ahead of key German survey on",
          "business sentiment2 Hours ago2 top stock recommendations from Vinay Rajani2",
          "Hours agoTrent, Polycab among 5 stocks with long buildup2 Hours agoNo broad",
          "brush, but be selectively bullish. 5 mid-cap stocks from different sectors with",
          "an upside potential up to 44%2 Hours agoCommodity Talk: Silver offers higher",
          "upside compared to gold, says Anuj Gupta of HDFC Securities3 Hours",
          "agoConsumption will be a big growth driver over next 3 years : Pankaj Murarka3",
          "Hours agoJapan's Nikkei snaps losing streak as tariff jitters ease3 Hours",
          "agoStocks to Buy: Anshul Saigal’s top sectors for long-term wealth creation3",
          "Hours agoIndian consumption sector's defensive shield cracks — can this rare 20%",
          "slide unlock an entry point? Motilal Oswal weighs in3 Hours agoSIP vs Lumpsum:",
          "Which strategy works best for you?3 Hours agoInflation-Protected debt: The hedge",
          "Indian retail investors need4 Hours agoWill FIIs drive the next market rally?",
          "Dinshaw Irani answers4 Hours agoFears about US recession overdone, rally in",
          "Indian market sustainable: Matt Orton4 Hours agoPower Boom Ahead? Anshul Saigal",
          "on multi-year opportunity in India’s energy sector5 Hours agoCement stocks rally",
          "up to 3% after UBS upgrades UltraTech, Dalmia Bharat, Ambuja to buy5 Hours",
          "agoF&O Radar | Deploy Bull Call Spread in Cummins India for gains from bullish",
          "outlook5 Hours agoSEBI’s move to ease compliance will attract smaller FPIs:",
          "Sunil Subramaniam5 Hours agoThese 5 F&O stocks saw a high increase in futures",
          "open interest5 Hours agoStocks to buy: UBS upgrades cement sector; Motilal Oswal",
          "sees 22% upside in Suzlon6 Hours agoSG Finserve stock hits 20% upper circuit",
          "after Madhusudan Kela buys 1.7% stake6 Hours agoHCL, TCS, and other IT stocks",
          "rise up to 2% after Trump eases tariff worries6 Hours agoIREDA shares jump 4%",
          "ahead of board meeting to consider borrowing plan for FY2025-266 Hours agoStock",
          "Radar: Tata Motors stock price is showing signs of rebound after 40% fall from",
          "highs; time to buy?6 Hours agoFed vs FII Flows: Who holds the key to India’s",
          "market rally? Ajay Bagga answers6 Hours agoFII investors flock back to Indian",
          "assets, turn buyers for 1st week this year6 Hours agoShriram Finance, Hindalco",
          "among 7 stocks that are near the buy point. Do you own any?6 Hours agoSensex",
          "crashes 750 points from day's high, trades flat; RIL & ICICI Bank lead the fall7",
          "Hours agoThese 3 stocks close crossing below VWAP March 247 Hours agoBritannia",
          "Industries shares in focus after strike disrupts Gujarat plant operations7 Hours",
          "agoTata Motors Share Price Live Updates: Tata Motors Price Movement7 Hours",
          "agoBajaj Auto Share Price Live Updates: Bajaj Auto's Current Price and Market",
          "Performance7 Hours agoM&M Share Price Live Updates: M&M Daily Trading Overview7",
          "Hours agoSun Pharma Share Price Live Updates: Sun Pharma's Market Activity7",
          "Hours agoHCL Tech Share Price Live Updates: HCL Tech Sees Positive Movement",
          "Today7 Hours agoCoal India Share Price Live Updates: Coal India  Reports Decline",
          "in Stock Price7 Hours agoKotak Bank Share Price Live Updates: Kotak Bank's Price",
          "and Returns Overview7 Hours agoStocks to buy today: Bharti Airtel, Vedanta among",
          "top 7 trading ideas for 25 March, 20257 Hours agoHindalco Share Price Live",
          "Updates: Hindalco's Current Price and Market Performance7 Hours agoTitan Company",
          "Share Price Live Updates: Titan Company stock price slips as returns falter7",
          "Hours agoRIL Share Price Live Updates: RIL's Stock Price Falls Below EMA",
          "Threshold7 Hours agoDivis Labs Share Price Live Updates: Divis Labs Stock",
          "Update7 Hours agoONGC Share Price Live Updates: ONGC's Market Update7 Hours",
          "agoJSW Steel Share Price Live Updates: JSW Steel's Recent Market Activity7 Hours",
          "agoHero MotoCorp Share Price Live Updates: Hero MotoCorp: Today's Price and",
          "Recent Performance7 Hours agoInfosys Share Price Live Updates: Infosys stock",
          "rises as market reacts7 Hours agoDr Reddys Share Price Live Updates: Dr. Reddys",
          "Stock Analysis7 Hours agoAdani Ent Share Price Live Updates: Adani Enterprises",
          "Shares Down Today7 Hours agoL&T Share Price Live Updates: L&T's Recent Market",
          "Activity7 Hours agoBritannia Share Price Live Updates: Britannia Sees Gains in",
          "Today's Market7 Hours agoHDFC Life Share Price Live Updates: HDFC Life's Price",
          "Movement7 Hours agoPower Grid Share Price Live Updates: Power Grid Daily Market",
          "Summary7 Hours agoAsian Paints Share Price Live Updates: Asian Paints Price",
          "Movement Analysis7 Hours agoGrasim Inds Share Price Live Updates: Grasim",
          "Industries Price Update: Strong Performance7 Hours agoBajaj Finance Share Price",
          "Live Updates: Bajaj Finance Trading Insights7 Hours agoLTIMindtree Share Price",
          "Live Updates: LTIMindtree  Trading Insights7 Hours agoJio Financial Services",
          "Share Price Live Updates: Jio Financial Services Current Market Performance7",
          "Hours agoHDFC Bank Share Price Live Updates: HDFC Bank Sees Positive Movement",
          "Today7 Hours agoEicher Motors Share Price Live Updates: Eicher Motors Current",
          "Market Status7 Hours agoUPL Share Price Live Updates: UPL's Price Movement",
          "Today7 Hours agoAdani Ports SEZ Share Price Live Updates: Adani Ports SEZ's",
          "stock shows a minor decline7 Hours agoBrigade Enterprises shares jump 7% on Rs",
          "950 crore land acquisition in Whitefield7 Hours agoTech Mahindra Share Price",
          "Live Updates: Tech Mahindra's Market Performance7 Hours agoUltraTech Cem Share",
          "Price Live Updates: UltraTech Cement's Price Surge7 Hours agoBPCL Share Price",
          "Live Updates: BPCL's Recent Market Activity7 Hours agoITC Share Price Live",
          "Updates: ITC's Current Price and Returns7 Hours agoNestle India Share Price Live",
          "Updates: Nestle India Financial Snapshot7 Hours agoWipro Share Price Live",
          "Updates: Wipro's Current Trading Price7 Hours agoICICI Bank Share Price Live",
          "Updates: ICICI Bank's Current Trading Status7 Hours agoTata Steel Share Price",
          "Live Updates: Tata Steel's Current Price and Recent Performance7 Hours agoCipla",
          "Share Price Live Updates: Cipla's Current Trading Price7 Hours agoTata Consumer",
          "Share Price Live Updates: Tata Consumer's Current Trading Status7 Hours agoNTPC",
          "Share Price Live Updates: NTPC Stock Performance Today7 Hours agoTCS Share Price",
          "Live Updates: TCS shares currently priced at Rs 3669.757 Hours agoApollo",
          "Hospital Share Price Live Updates: Apollo Hospital's Price Movement Today7 Hours",
          "agoBharti Airtel Share Price Live Updates: Bharti Airtel's Current Market",
          "Position7 Hours agoBajaj Finserv Share Price Live Updates: Bajaj Finserv's stock",
          "price rises amid market fluctuations7 Hours agoHUL Share Price Live Updates:",
          "HUL's Financial Snapshot7 Hours agoMaruti Suzuki Share Price Live Updates:",
          "Maruti Suzuki's Current Trading Status7 Hours agoBFSI stocks in focus as RBI",
          "revises priority sector lending guidelines to boost credit access7 Hours",
          "agoPower Grid shares in focus after acquisition of 3 project SPVs for nearly Rs",
          "44 cr7 Hours agoETMarkets AIF Talk | Double-Digit returns amid equity",
          "volatility: How Vivriti’s debt funds are navigating market uncertainty7 Hours",
          "agoOla Electric shares in focus after settling dues with Rosmerta Group; NCLT",
          "petitions withdrawn7 Hours agoThese 3 stocks closed above VWAP on March 247",
          "Hours agoSBI Life Share Price Live Updates: SBI Life's Current Trading Status7",
          "Hours agoAt multi-year highs: These 3 stocks witness 5-year swing high",
          "breakouts7 Hours agoSBI Life Insurance shares in focus after Rs 352.50 crore",
          "Income Tax order7 Hours agoSlowly money coming back to India, stage being set",
          "nicely for a good rally: Ajay Bagga8 Hours agoGRSE shares rise 5% on deal with",
          "German firm for 2 multi-purpose vessels8 Hours agoPositive Breakout: These 7",
          "stocks cross above their 200 DMAs8 Hours agoIndusInd Bank Share Price Live",
          "Updates: IndusInd Bank  Trading InsightsIndia’s stock market rebound is blowing",
          "past technical barriersShri Ahimsa Naturals IPO booked 31% so far on Day 1SIP vs",
          "Lumpsum: Which strategy works best for you?Anshul Saigal suggests these sectors",
          "as key for long-term wealth creationThese 10 stocks gained over 30% in just 6",
          "sessionsATC Energies IPO subscribed 33% so far on Day 1Silver offers higher",
          "upside as against gold: This expert explains key factors4 large, midcap stocks",
          "that hit 52-week highs todayConsumption sector falls 20%: Buying window ahead?4",
          "strategic themes to drive D-St’s long-term growthThis mutual fund scheme takes",
          "the crown in FY25HCL, other IT stocks rise as Trump eases tariff worriesIREDA",
          "shares up 4% as board to consider borrowing planFed vs FII flows: Who holds the",
          "key to D-Street’s rally?FIIs turn buyers of Indian stocks for the first week in",
          "2025Smallcap hits 20% upper circuit as Kela buys 1.7% stakeHindalco among top 7",
          "stocks that are near the buy pointCryptoCornerPowered byBlackRock debuts Bitcoin",
          "exchange-traded product in EuropeCryptocurrencyExpert ViewsYear of largecaps and",
          "quality stocksNimesh Chandan2 top stock picks for near termVinay RajaniSilver",
          "offers higher upsideAnuj GuptaConsumption to drive growthPankaj MurarkaExpert",
          "ViewsMarket MogulsSIP vs Lumpsum: Which strategy works best for you?Ajit",
          "MenonUnlocking Value: Why REITs & InvITs deserve the spotlightSunil",
          "SanghaiETMarkets Watch5 Days ago| Mar 19, 2025D-Street soars on banking and",
          "metal strength; Sensex adds 148 points, Nifty tops 22,900Listen02:18Gainers &",
          "Losers: IndusInd Bank, HEG Ltd among 11 stocks that hogged limelight todayStocks",
          "to Buy | Market volatility & SIPs: Dinshaw Irani’s advice for retail",
          "investorsThese 10 stocks delivered over 30% gains in just 6 sessionsSBI Card,",
          "Shree Cement among 4 large and mid-cap stocks that hit 52-week highs on",
          "TuesdayTrent, Polycab among 5 stocks with long buildup12345PodcastSlideshowStock",
          "Recommendations6 Hours agoCoal India",
          "LtdBUYPrice398.30-1.90%Target₹449BrokerageAxis Securities6 Hours",
          "agoBHELBUYPrice213.60-1.82%Target₹358BrokerageJM Financial6 Hours",
          "agoBELBUYPrice300.03-0.69%Target₹350BrokerageICICI Securities7 Hours",
          "agoGreenpanel IndREDUCEPrice237.751.09%Target₹210BrokerageHDFC Securities7 Hours",
          "agoKalyan Jewellers IndADDPrice469.20-4.22%Target₹520BrokerageICICI Securities1",
          "Day agoJK CementBUYPrice4,749.250.18%Target₹5,300BrokerageJM FinancialStock",
          "RecosMy WatchlistSign In  |  Sign UpHourly GainersBharat",
          "Forge1,186.25(0.88%)Patanjali Foods1,774.80(0.66%)Nippon Life",
          "AMC601.00(0.61%)Ipca Labs1,446.75(0.47%)Sundaram Finance4,770.50(0.43%)Bharti",
          "Hexacom1,441.10(0.35%)Au Small Fin Bank557.90(0.31%)Grasim",
          "Inds.2,569.45(0.20%)Pidilite Ind2,823.05(0.18%)Asian",
          "Paints2,330.75(0.17%)12345No broad brush, but be selectively bullish. 5 mid-cap",
          "stocks from different sectors with an upside potential up to 44%12 mins readAs",
          "Nifty & Sensex recover, these large-caps have ‘strong buy’, ‘buy’ recos, with an",
          "upside potential of more than 30%18 mins readWeekly Top Picks: These stocks",
          "scored 10 on 10 on Stock Reports Plus5 mins readStock Radar: Coal India stock",
          "breaks out from consolidation range on weekly charts; time to buy?3 mins",
          "readByKshitij AnandTwo Trades for Today: A defence major for over 8% surge, a",
          "PSU infra finance stock for 6% rise4 mins readTop Nifty50 stocks analysts",
          "suggest buying in this volatile week3 mins readStock Radar: Focus on private",
          "banking stocks! HDFC Bank looking attractive to buy after profit taking?3 mins",
          "readByKshitij AnandOne index which better reflects undercurrent of the economy &",
          "should be watched before Nifty32 mins readTwo Trades for Today: A payment",
          "services major for 8% gain, a mid-cap chemicals stock for almost 7% upmove4 mins",
          "readGerman move: Time to change bias to Hold & Buy? 5 PSU & 5 private defence",
          "stocks with an upside potential of up to 50%15 mins readF&O Radar | Deploy Bull",
          "Call Spread in Cummins India for gains from bullish outlook3 mins readByNishtha",
          "AwasthiStock Radar: Tata Motors stock price is showing signs of rebound after",
          "40% fall from highs; time to buy?3 mins readByKshitij AnandIt is not always",
          "about buying or selling; sometimes, just ‘hold’ stocks: 10 large-caps with an",
          "upside potential of up to 49%16 mins readFour words: Bullish, selective,",
          "cautious, quality. 6 mid-cap stocks from different sectors with upside potential",
          "of up to 42%15 mins readStock picks of the week: 5 stocks with consistent score",
          "improvement and potential to give a return of over 32% in 1 year16 mins",
          "readPharma: Stay bullish, but hedge to avoid mistake of selling due to deadline.",
          "7 stocks with upside potential of up to 50%12 mins readWhat to do with stocks of",
          "BSE, CDSL & others that live and breathe the stock market? Is the best behind",
          "them?15 mins readStock Radar: Why is Kotak Mahindra Bank hitting fresh 52-week",
          "highs? What should investors do?3 mins readByKshitij AnandRailways stocks: Time",
          "for a contrarian stand? Probably yes, but hedge. 6 stocks: 1 buy, 1 hold, and 4",
          "with sell recos13 mins readThese large- and mid-cap stocks can give more than",
          "21% return in 1 year, according to analysts15 mins read1234567Stocks",
          "DashboardSectors DashboardNewMost Active - ValueMost Active - VolumeTop",
          "GainersTop Losers52 Week High52 Week LowVolume ActionNifty 500Nifty 50Nifty",
          "500Nifty MidCap 100Nifty 100Nifty 200As on Mar 25, 2025 04:05",
          "PMNSEBSENamePriceChg%ChgValue(Cr.)Upside PotentialSee Full",
          "PotentialwithETPRIMEHDFC Bank1,82121.501.2%3,570ICICI Bank1,344-14.46-",
          "1.07%2,210BSE4,652-3.41-0.08%1,937Zomato209.81-13.00-5.84%1,797RIL1,285-16.65-",
          "1.28%1,770Infosys1,62835.702.25%1,608Kotak Bank2,170-6.16-0.29%1,606Most Active",
          "- ValueAs on Mar 25, 2025 04:19 PMSector NameMCap(₹ Cr.)Advances/Declines1D",
          "Chg%1W Chg%Upside PotentialLeather77,2881429.8011.48Upto 37% Upside3 stocks to",
          "UnlockIT Software35,27,195110315.738.02Upto 66% Upside16 stocks to",
          "UnlockTextiles1,69,060126495.3812.30Upto 36% Upside4 stocks to UnlockHospitals &",
          "Allied Services5,00,19929194.503.83Upto 51% Upside7 stocks to",
          "UnlockAuto20,74,8781454.344.59Upto 33% Upside7 stocks to",
          "UnlockServices7,60,82144154.2313.77Upto 71% Upside14 stocks to UnlockView All",
          "SectorsMarket Calendar25 MarBajaj Finance Ltd.POM 25/03/202525 MarMaruti Suzuki",
          "India Ltd.POM 25/03/202525 MarTata Consumer Products Ltd.POM 25/03/202525",
          "MarAshok Leyland Ltd.POM 25/03/2025View FullMarket CalendarEnd your Buy or Sell",
          "dilemma with 100+ Daily Stock RecosScan QR to get AppTop Searches123Stock Market",
          "Today LiveStocks to Buy TodayKEI share priceGRSE Share PriceInfosys share",
          "priceWhy Indusind Bank is Falling?Stocks to BuyCoal India Share PricePolycab",
          "Stock PricePi NetworkListing TodayHexaware Technologies Share Price LiveZen",
          "Technologies Share PriceStock Reports PlusPowered ByHigh UpsideTop Score",
          "CompaniesAnalyst FavsBuyMean Recos by 3 Analysts0Strong",
          "Sell0Sell1Hold1Buy1Strong BuyView ReportExpected Returns91.10 %1Y  TargetCurrent",
          "PriceStrong BuyMean Recos by 4 Analysts0Strong Sell0Sell0Hold1Buy3Strong BuyView",
          "ReportExpected Returns89.30 %1Y  TargetCurrent PriceBuyMean Recos by 7",
          "Analysts0Strong Sell0Sell4Hold1Buy2Strong BuyView ReportExpected Returns86.20",
          "%1Y  TargetCurrent PriceBuyMean Recos by 4 Analysts0Strong",
          "Sell0Sell2Hold0Buy2Strong BuyView ReportExpected Returns85.20 %1Y  TargetCurrent",
          "PriceView More Reports10/10Stock ScoreView ReportNo Rating",
          "(NR)NegativeNeutralPositiveEarnings10Fundamentals9Relative Valuation6Risk7Price",
          "Momentum810/10Stock ScoreView ReportNo Rating",
          "(NR)NegativeNeutralPositiveEarnings10Fundamentals7Relative Valuation10Risk9Price",
          "Momentum410/10Stock ScoreView ReportNo Rating",
          "(NR)NegativeNeutralPositiveEarnings8Fundamentals8Relative Valuation6Risk9Price",
          "Momentum910/10Stock ScoreView ReportNo Rating",
          "(NR)NegativeNeutralPositiveEarnings10Fundamentals8Relative Valuation7Risk9Price",
          "Momentum4View More ReportsBuyMean Recos by 40 Analysts3Strong",
          "Sell2Sell8Hold13Buy14Strong BuyView ReportExpected Returns27.50 %1Y",
          "TargetCurrent PriceBuyMean Recos by 39 Analysts0Strong",
          "Sell0Sell7Hold14Buy18Strong BuyView ReportExpected Returns18.40 %1Y",
          "TargetCurrent PriceBuyMean Recos by 37 Analysts0Strong",
          "Sell0Sell6Hold13Buy18Strong BuyView ReportExpected Returns10.60 %1Y",
          "TargetCurrent PriceHoldMean Recos by 37 Analysts1Strong",
          "Sell7Sell13Hold10Buy6Strong BuyView ReportExpected Returns59.80 %1Y",
          "TargetCurrent PriceView More ReportsUpskill, grow your career and master stock",
          "strategies!Maximise Returns by Investing in the Right CompaniesThe Economic",
          "TimesGet Certified By India's Top Business News BrandView CourseRenko Chart",
          "Patterns Made EasyKaushik AkiwatkarDerivative Trader and InvestorView",
          "CourseCandlesticks Made Easy: Candlestick Pattern CourseelearnmarketsFinancial",
          "Education by StockEdgeView CourseDow Theory Made EasyVishal MehtaIndependent",
          "Systematic TraderView CourseMarket 101: An Insight into Trendlines and",
          "MomentumRohit SrivastavaFounder- Indiacharts.comView CourseMarkets 102:",
          "Mastering Sentiment Indicators for Swing and Positional TradingRohit",
          "SrivastavaFounder- Indiacharts.comView CourseMarket 103: Mastering Trends with",
          "RMI and Techno-Funda InsightsRohit SrivastavaFounder- Indiacharts.comView",
          "CourseMarket 104: Options Trading: Kickstart Your F&O AdventureSaketh RFounder-",
          "QuickAlpha, Full Time Options TraderView CourseROC Made Easy: Master Course for",
          "ROC Stock IndicatorSouradeep DeyEquity and Commodity Trader, TrainerView",
          "CourseRSI Made Easy: RSI Trading CourseSouradeep DeyEquity and Commodity Trader,",
          "TrainerView CourseTechnical Analysis for Everyone - Technical Analysis",
          "CourseAbhijit PaulTechnical Research Head, Fund Manager- ICICI SecuritiesView",
          "CourseIntroduction to Technical Analysis & Candlestick TheoryDinesh NagpalFull",
          "Time Trader, Ichimoku & Trading Psychology ExpertView CourseOptions Trading",
          "Course For BeginnersChetan PanchamiaOptions TraderView CourseOptions Scalping",
          "Made EasySivakumar JayachandranAce ScalperView CourseFutures Trading Made Easy:",
          "Future & Options Trading CourseAnirudh SarafFounder- Saraf A & Associates,",
          "Chartered AccountantView Course12345678CompaniesNews That's Moving Your StocksBy",
          "2030, Akasa will be among 30 largest global airlines by fleet size; may grab 15%",
          "India market share in 5-7 years: Vinay DubePB Fintech is the incubator, the",
          "catalyst, not the eventual owner of the healthcare project: Yashish DahiyaI will",
          "go where the consumer is as Tata Consumer transforms  from a commodity to a",
          "branded company: Sunil D'SouzaNot hiking prices for 10 quarters is a very",
          "conscious decision;  it helped us gain massive market share: Sameer KhetarpalWhy",
          "is Jubilant FoodWorks growing when peers are struggling? Sameer Khetarpal",
          "explainsCompaniesSectoral PerformanceTelecommunications19 Declines3",
          "AdvancesMarket Cap13,98,984 Cr.Chg (%Chg)51,422.12 (3.82%)Retail12 Declines8",
          "AdvancesMarket Cap5,25,996 Cr.Chg (%Chg)10,908.88 (2.12%)IT Software59",
          "Declines23 AdvancesMarket Cap35,91,134 Cr.Chg (%Chg)27,350.44 (0.77%)All",
          "SectorsSectoral IndicesIndicesPriceChg%ChgNifty Midcap",
          "10051,969.75-554.31-1.06BSE SmallCap47,070.40-781.12-1.63Nifty",
          "IT37,706.90489.851.32Nifty Bank51,607.95-97.00-0.19Nifty",
          "Auto21,737.60-201.11-0.92Nifty Pharma21,542.50-228.66-1.05Nifty",
          "FMCG53,131.30-101.45-0.19Nifty Financial Services25,086.0028.460.11All",
          "IndicesAdvertisementBuy/Sell SignalsBullish MovingAverage CrossoverBearish",
          "MovingAverage CrossoverBullish MACDCrossoverBearish MACDCrossoverBullish",
          "StochasticCrossoverBearish StochasticCrossoverEMA 5EMA 10EMA 14EMA 20EMA 50EMA",
          "200Formed on Mar 21, 2025NSEBSENamePriceChg%ChgGain*VolumeCoforge8,033.15263.603",
          ".40%3.78%7,60,621Mphasis2,536.1053.162.15%3.83%6,07,347Redington246.253.341.38%5",
          ".21%28,25,442Karur Vysya Bank211.622.531.21%5.10%53,14,454eClerx",
          "Services2,789.2531.061.13%4.56%60,874Au Small Fin",
          "Bank556.005.961.09%3.85%32,43,752*Note:Gain% is the average price movement",
          "within 7 days of signal in last 5 yearsBSE AnnouncementVadilal Dairy",
          "International Ltd.25 Mar,2025, 04:19PM ISTClosure of Trading WindowSamrat",
          "Forgings25 Mar,2025, 04:19PM ISTClosure of Trading WindowAavas Financiers25",
          "Mar,2025, 04:19PM ISTClosure of Trading WindowAll AnnouncementsET",
          "SpecialsSPONSOREDWhat should WazirX do to unlock trust?NIFTY 50",
          "STOCKS12345UltraTech Cement. Share PriceBajaj Finserv. Share PriceTrent. Share",
          "PriceInfosys. Share PriceGrasim Industries. Share PriceAxis Bank. Share PriceHCL",
          "Technologies. Share PriceHDFC Bank. Share PriceBritannia Industries. Share",
          "PriceTata Consultancy Services. Share PriceBharti Airtel. Share PriceHindustan",
          "Unilever. Share PriceWipro. Share PriceApollo Hospitals Enterprise. Share",
          "PriceAsian Paints. Share PriceEicher Motors. Share PriceHero MotoCorp. Share",
          "PriceJSW Steel. Share PriceTata Consumer Products. Share PriceTech Mahindra.",
          "Share PriceBajaj Finance. Share PriceITC. Share PriceKotak Mahindra Bank. Share",
          "PricePower Grid Corporation of India. Share PriceLarsen & Toubro. Share",
          "PriceNestle India. Share PriceMaruti Suzuki India. Share PriceTata Motors. Share",
          "PriceBharat Petroleum Corporation. Share PriceNTPC. Share PriceShriram Finance.",
          "Share PriceOil And Natural Gas Corporation. Share PriceBharat Electronics. Share",
          "PriceSBI Life Insurance Company. Share PriceTitan Company. Share PriceCipla.",
          "Share PriceHDFC Life Insurance Company. Share PriceState Bank of India Share",
          "PriceTata Steel. Share PriceICICI Bank. Share PriceSun Pharmaceutical",
          "Industries. Share PriceHindalco Industries. Share PriceReliance Industries.",
          "Share PriceMahindra & Mahindra. Share PriceBajaj Auto. Share PriceAdani Ports &",
          "Special Economic Zone. Share PriceCoal India. Share PriceAdani Enterprises.",
          "Share PriceDr. Reddy's Laboratories. Share PriceIndusInd Bank. Share",
          "PriceCryptocurrencyBitcoin, Blockchain and All ElsePowered byBlackRock debuts",
          "Bitcoin exchange-traded product in EuropeCrypto price today: Bitcoin rebounds to",
          "$88k before cooling off; Altcoins show mixed trendsBitcoin and the psychology of",
          "wealth: Robert Kiyosaki on why most people stay poorThe rise of Crypto Futures",
          "in India: Leverage, tax efficiency and market maturity, Avinash Shekhar of Pi42",
          "explainsCrypto price today: Bitcoin rises above $86k; Avalanche, Solana jump up",
          "to 10%CryptocurrencyTop CryptocurrenciesAs on Mar 25, 2025 04:15",
          "PMNameSymbolPrice (INR)M.Cap (Cr.)Vol (24h, Cr.)Bitcoin",
          "PriceBTC74,76,9431,48,32,8762,50,482Ethereum",
          "PriceETH1,77,84121,44,40599,052Tether PriceUSDT85.7212,32,7252,54,486XRP",
          "PriceXRP21012,19,18023,942BNB PriceBNB54,8167,99,75010,987Solana",
          "PriceSOL12,2336,25,12232,980USDC PriceUSDC85.705,12,56483,686Dogecoin",
          "PriceDOGE15.992,37,07214,510MOREIndia Inc's ScorecardAccenture raises full-year",
          "revenue forecast on AI services demandTarget shares up 4% after it posts strong",
          "Q4 profits & sales, but warns on impact of tariffsInternational Gemmological",
          "Institute Q4 Results: Net profit jumps 45% to Rs 78 croreNvidia's profit jumps",
          "80% as company rides tech's AI boomSpiceJet clocks profit on reduced",
          "expenseSpiceJet Q3 Results: Co posts Rs 26 profit vs loss a year ago; revenue up",
          "35%All StoriesCurrenciesForex & FuturesData lifts dollar as Trump talks",
          "tariffsRupee posts largest weekly rise in more than 2 years on inflowsForex",
          "RatesCurrencyPrice%ChgDXY Index104.270.01USD/INR85.720.08EUR/INR92.67-",
          "0.16GBP/INR110.85-0.12CNY/INR11.810.04USD/JPY150.46-0.16USD/CNY7.260.08Forex",
          "RatesCurrency ConverterAfghanistan AfghaniArgentine PesoAustralian",
          "DollarAustrian SchillingBahraini DinarBangladeshi TakaBermudian DollarBhutan",
          "NgultrumBolivian BolivianoBosnian MarkBotswana PulaBrazilian RealBritish",
          "PoundCambodian RielCanadian DollarChilean PesoChinese Yuan RenminbiColombian",
          "PesoCongolese FrancCosta Rican ColonCroatian KunaCuban PesoCyprus PoundCzech",
          "KorunaDanish KroneDominican PesoEcuador SucreEgyptian PoundEthiopian",
          "BirrEuroFiji DollarFrench FrancGerman MarkGhanaian CediGreek DrachmaGuatemalan",
          "QuetzalHong Kong DollarHungarian ForintIceland KronaIndian RupeeIndonesian",
          "RupiahIranian RialIraqi DinarIsraeli New ShekelItalian LiraJamaican",
          "DollarJapanese YenJordanian DinarKenyan ShillingKorean WonKuwaiti DinarLebanese",
          "PoundLiberian DollarLibyan DinarLuxembourg FrancMacau PatacaMalaysian",
          "RinggitMaldive RufiyaaMauritius RupeeMexican PesoMongolian TugrikMoroccan",
          "DirhamMozambique MeticalMyanmar KyatNepalese RupeeNew Zealand DollarNigerian",
          "NairaNorwegian KronerOmani RialPakistan RupeePanamanian BalboaPapua New Guinea",
          "KinaParaguay GuaraniPeruvian Nuevo SolPhilippine PesoPolish ZlotyQatari",
          "RialRussian RoubleSaudi RiyalSerbian DinarSeychelles RupeeSingapore DollarSouth",
          "African RandSri Lanka RupeeSudanese PoundSwedish KronaSwiss FrancTaiwan",
          "DollarTanzanian ShillingThai BahtTrinidad/Tobago DollarTurkish LiraUganda",
          "ShillingUruguayan PesoUS DollarUt. Arab Emir. DirhamVenezuelan BolivarVietnamese",
          "DongYemeni RialZambian KwachaToAfghanistan AfghaniArgentine PesoAustralian",
          "DollarAustrian SchillingBahraini DinarBangladeshi TakaBermudian DollarBhutan",
          "NgultrumBolivian BolivianoBosnian MarkBotswana PulaBrazilian RealBritish",
          "PoundCambodian RielCanadian DollarChilean PesoChinese Yuan RenminbiColombian",
          "PesoCongolese FrancCosta Rican ColonCroatian KunaCuban PesoCyprus PoundCzech",
          "KorunaDanish KroneDominican PesoEcuador SucreEgyptian PoundEthiopian",
          "BirrEuroFiji DollarFrench FrancGerman MarkGhanaian CediGreek DrachmaGuatemalan",
          "QuetzalHong Kong DollarHungarian ForintIceland KronaIndian RupeeIndonesian",
          "RupiahIranian RialIraqi DinarIsraeli New ShekelItalian LiraJamaican",
          "DollarJapanese YenJordanian DinarKenyan ShillingKorean WonKuwaiti DinarLebanese",
          "PoundLiberian DollarLibyan DinarLuxembourg FrancMacau PatacaMalaysian",
          "RinggitMaldive RufiyaaMauritius RupeeMexican PesoMongolian TugrikMoroccan",
          "DirhamMozambique MeticalMyanmar KyatNepalese RupeeNew Zealand DollarNigerian",
          "NairaNorwegian KronerOmani RialPakistan RupeePanamanian BalboaPapua New Guinea",
          "KinaParaguay GuaraniPeruvian Nuevo SolPhilippine PesoPolish ZlotyQatari",
          "RialRussian RoubleSaudi RiyalSerbian DinarSeychelles RupeeSingapore DollarSouth",
          "African RandSri Lanka RupeeSudanese PoundSwedish KronaSwiss FrancTaiwan",
          "DollarTanzanian ShillingThai BahtTrinidad/Tobago DollarTurkish LiraUganda",
          "ShillingUruguayan PesoUS DollarUt. Arab Emir. DirhamVenezuelan BolivarVietnamese",
          "DongYemeni RialZambian KwachaAmount ConvertConvertTrending in markets:Sensex",
          "TodayStocks in NewsStocks to BuyPolycab Stock PriceGarden Reach Shipbuilders",
          "Share PriceMobiKwik Share PriceIndusInd Bank SharesWhy IndusInd Bank Share is",
          "Falling?Pi Coin Price PredictionHexaware Technologies Share PriceNykaa Q3",
          "ResultsVA Tech Wabag ShareLIC Q3 ResultsSBI share priceBharti Airtel Share",
          "PriceReliance Power Stock PriceSwiggy Stock PriceSwiggy Results 2025Gold Price",
          "TodayVishal Mega Mart Share PriceONGC Share PriceITC Shares PriceBudget day",
          "trading strategyAdani Enterprises Q3 Results 2025Adani Ports Share PriceBajaj",
          "Finserv Share PriceWhirlpool India Share PriceTata Motors Stock PriceKPIT Share",
          "PriceAmbuja Cement Q3 Results FY25IPOStartups, Grey Market, DRHP, ListingsShri",
          "Ahimsa Naturals IPO subscribed 31% so far on Day 1: Check GMP, price band and",
          "other detailsZepto in talks for $250 million secondary sale ahead of IPOATC",
          "Energies System IPO to open for subscription today. Check issue price, GMP,",
          "other detailsShri Ahimsa Naturals IPO to open for subscription today. Check",
          "issue price, GMP, other detailsESDS Software to file DRHP this week to raise",
          "upto Rs 700 crore through IPOIPOIPO /OpenUpcomingListing soonListedIPO NameIssue",
          "PriceIssue SizeIssue OpenIssue CloseActive Infrastructures Ltd.178-18177.83",
          "Cr21-03-202525-03-2025Rapid Fleet Management Services Ltd.183-19243.87",
          "Cr21-03-202525-03-2025Desco Infratech Ltd.147-15030.75",
          "Cr24-03-202526-03-2025Shri Ahimsa Naturals Ltd.113-11973.81",
          "Cr25-03-202527-03-2025ATC Energies System Ltd.112-11863.76",
          "Cr25-03-202527-03-2025Open IPOIPO NameIssue PriceIssue SizeIssue OpenIssue",
          "CloseIdentixweb Ltd.51-5416.63 Cr26-03-202528-03-2025Retaggio Industries",
          "Ltd.2515.49 Cr27-03-202501-04-2025Aten Papers and Foam Ltd.91-9622.19",
          "Cr28-03-202502-04-2025Infonative Solutions Ltd.75-7924.71",
          "Cr28-03-202503-04-2025Spinaroo Commercial Ltd.5110.18",
          "Cr28-03-202503-04-2025Upcoming IPOIPO NameIssue PriceIssue SizeIssue OpenIssue",
          "CloseRosmerta Digital Services Ltd.140-147206.33 Cr18-11-202421-11-2024Property",
          "Share Investment Trust REIT10,00,000-10,50,000352.90",
          "Cr02-12-202404-12-2024Solar91 Cleantech Ltd.185-185106.00",
          "Cr24-12-202427-12-2024Arisinfra Solutions Ltd.200-210600.00",
          "Cr03-02-202505-02-2025Grand Continent Hotels Ltd.107-11374.46",
          "Cr20-03-202524-03-2025Listing Soon IPOIPO NameIssue PriceIssue SizeIssue",
          "OpenIssue CloseParadeep Parivahan Ltd.93-9844.86 Cr17-03-202519-03-2025Divine",
          "Hira Jewellers Ltd.9031.84 Cr17-03-202519-03-2025Super Iron Foundry Ltd.10868.05",
          "Cr11-03-202513-03-2025PDP Shipping & Projects Ltd.13512.65",
          "Cr10-03-202512-03-2025NAPS Global India Ltd.9011.88 Cr04-03-202506-03-2025Balaji",
          "Phosphates Ltd.66-7050.11 Cr28-02-202504-03-2025Shreenath Paper Products",
          "Ltd.4423.36 Cr25-02-202528-02-2025Listed IPOTwo Sharp with ET: How India plans",
          "to tackle Trump’s tariff threat & Markets soar past 78,000 on FII comebackStock",
          "Radar | Why does it make sense to accumulate HDFC Bank at current levels? Ajit",
          "Mishra decodesGainers & Losers: IndusInd Bank, HEG Ltd among 11 stocks that",
          "hogged limelight todayStocks to Buy | Market volatility & SIPs: Dinshaw Irani’s",
          "advice for retail investorsThese 10 stocks delivered over 30% gains in just 6",
          "sessionsCommodityBullion, Base Metals & All ElseOil prices little changed as",
          "investors weigh impact of Trump tariffsGold slips as Trump eases tariff threats,",
          "Fed shows caution over rate cutSebi extends suspension of trading in 7 commodity",
          "derivatives until Mar 2026Gold Price Today: Yellow metal sees heavy profit",
          "booking, falling Rs 2,000/10 gms from all-time highGold edges higher on safe-",
          "haven demand, Fed optimismCommodityCalendar Spread(Far - Near month",
          "contract)CommoditySpread (Rs)UnitCotton Candy1,1501 CANDYKapas3020 KGSLead",
          "Mini31 KGSLead31 KGSSilver Micro1,8001 KGSSilver M1,7571 KGSCalendar",
          "SpreadGainersLosersCommodityPrice(Rs)%ChgExpiryCrude Oil5,964.001.12Jun 18,",
          "2025Crude Oil5,985.000.91Apr 21, 2025Crude Oil Mini5,984.000.89Apr 21,",
          "2025Zinc278.550.87Apr 30, 2025Crude Oil5,968.000.86May 19,",
          "2025Silver98,316.000.84May 05, 2025Future GainersOther AssetsMF, PMS, AIF,",
          "BondsInflation-Protected debt: The hedge Indian retail investors needFidelity,",
          "Schwab block orders of BlackRock, Texas Cap ETFsUS treasuries dip as tariff",
          "targets seem to changeChirag Doshi's bond strategy for FY26: What should",
          "investors do?$2.69 trillion and counting: How India’s bond market is powering a",
          "$8T futureOther AssetsEnter search",
          "text:BrowseCompanies:ABCDEFGHIJKLMNOPQRSTUVWXYZ123456789Quick LinksMOREMobiKwik",
          "Shares NewsReliance Power Preferential IssueHDB Financial Services IPOWestern",
          "Carriers IPO Allotment StatusITD Cementation Share PriceUS Fed Meeting",
          "TimeReliance Power Share PriceGST Council Meeting LiveBaazar Style Retail IPOHAL",
          "Share PriceNiftyShare Market LiveBajaj Housing Finance Share PriceTCS Q4",
          "ResultsAdani Green Q2 ResultsMaruti Suzuki Q2 ResultsCipla Q2 ResultsMamaearth",
          "IPONestle India Q3 ResultsHot on WebMOREIPL Ticket BookingGRSE Share PriceSensex",
          "TodayStocks in NewsWWE Raw Live StreamingWhere to Watch Delhi Capitals vs",
          "Lucknow Match LiveDC vs LSG Pitch ReportDC vs LSG Playing 11DC vs LSG Head to",
          "HeadBank Strike TodayWorld TB DayGRSE Share PriceNCC Share PriceVanessa TrumpRPF",
          "Constable RecruitmentIPL 2025 Opening Ceremony Live UpdatesSRH VS RR Live",
          "ScoreIn Case you missed itMOREStock Market LIVEAfcons InfrastructureIREDA Q2",
          "ResultsReliance Power Preferential IssueManba Finance IPOHDB Financial Services",
          "IPOCochin Shipyard Share PriceNorthern Arc Capital IPO AllotmentArkade",
          "Developers IPO Allotment TodayStocks in news todayUS Fed Meeting TimeUS Fed Rate",
          "Cut TodayNSE Bonus Issue Record DateBSE Share PriceBajaj Housing Finance IPO",
          "Listing LiveBajaj Housing Finance Share PriceTata Power Share PriceMORETop",
          "Searched CompaniesIRFC share priceSuzlon share priceIREDA share priceTATA Motors",
          "share priceYes bank share priceHDFC Bank share priceNHPC share priceRVNL share",
          "priceSBI share priceTata power share priceTata steel share priceAdani power",
          "share pricePaytm share pricePNB share priceZomato share priceBEL share priceBHEL",
          "share priceInfosys share priceIRCTC share priceITC share priceJIO finance share",
          "priceLIC share priceReliance share priceHAL share priceJP Power share priceNBCC",
          "share priceTCS share priceVedanta share priceWipro share priceIOC share",
          "priceIrcon share priceSAIL share priceSJVN share priceGAIL share priceHUDCO",
          "share priceREC share priceReliance Power share priceTata Technologies share",
          "priceVodafone idea share priceAdani Enterprises share priceAdani Green share",
          "priceAdani Port share priceAshok Leyland share priceBank of Baroda share",
          "priceBSE share priceCanara Bank share priceCDSL share priceCoal India share",
          "priceHFCL share priceIDFC First Bank share priceTop CalculatorsMOREStandard",
          "Deviation CalculatorIncome Tax CalculatorAge CalculatorSIP CalculatorTime",
          "CalculatorBMI CalculatorGPA CalculatorStatistics CalculatorFraction",
          "CalculatorDiabetes Risk CalculatorDate CalculatorLog CalculatorMORETop",
          "CommoditiesGold RateMenthaoil RateNickel RateKapas RateCopper RateZinc",
          "RateSilver RateCotton RateAluminium RateCrudeoil RateMORETop Prime ArticlesNo 5g",
          "Service Lack Of Fresh Funds Could Further Hurt Vodafone Idea Even As Airtel Jio",
          "Leap AheadFalling Off The Momentum Why Retail Investors Are Losing Money After",
          "Witnessing A Long RallyIs Nifty Next 50 A Good Bet Only If You Are A Super Long",
          "Term InvestorAdani Group Stocks Will Averaging Out Work For Retail InvestorsWe",
          "Want To Solve The Wazirx Binance Issue Once And For All Nischal ShettyReliance",
          "Jiocinema Is Streaming Ipl 2023 For Free Will This Now Disrupt The Ott",
          "BusinessNippon India  Fund DirectAfter Adani Stocks Hindenburg May Have Crashed",
          "Into Indias Green Hydrogen Mission TooIndian It Companies Rode The Cloud Wave As",
          "Hyperscalers Growth Tapers How Will It Impact ThemMens Underwear Sales Are",
          "Falling Should Indian Economy Prepare For A Below The Belt JoltMORETop Story",
          "ListingSgx NiftyDangalLicEarthquake TodayEpfo PensionEarthquake In DelhiTcs",
          "LayoffsNifty CrashStock Market CrashEpfoMORETop DefinitionsAccountingCurrency",
          "SymbolMarketsMarketing MixProductMapsko Builders Private",
          "LimitedFpoBusinessFiscal DeficitRepo RateMORETop SlideshowHow Rajendra Badwe Is",
          "Making Cancer Treatment Affordable By Repurposing Easily Available DrugsIcici",
          "BankAxis BankStock IdeasRaw VegetablesMORETop Market PagesFully Drawn",
          "AdvanceLatest NewsSMFG India Credit raises $175 million via ECB from Standard",
          "Chartered Bank & CTBC BankFor Musk's Starlink, India approval could unlock",
          "emerging marketsGT vs PBKS Pitch Report: How will the surface at Narendra Modi",
          "Stadium in Ahmedabad play for today's match'This is not Indian Idol': Neha",
          "Kakkar's video of crying on stage goes viral as upset fans criticise her for",
          "three-hour delay in MelbourneLok Sabha passes Finance Bill, 2025 after including",
          "35 government amendmentsORIX Corporation India secures Rs 300 crore investment",
          "from Japanese parent firmRupee's winning streak halts as importers step in,",
          "Asian peers slipWith $107 billion revenue in 2024, and sales of 4.3 million",
          "vehicles, Chinese EV maker BYD roars past Tesla'Hum Honge Kangal Ek Din': Kunal",
          "Kamra releases new satirical video taking a dig at Shiv Sena protestorsShare",
          "market update: Most active stocks of the day in terms of traded valueDelhi",
          "traffic police targets top three traffic violators with over 2000 pending",
          "challansChina's DeepSeek releases AI model upgrade, intensifies rivalry with",
          "OpenAIElon Musk dons new MAGA hat with greatest message for Trump at cabinet",
          "meet. President calls him 'patriot'Stock market update: Mining stocks down as",
          "market risesHow companies are responding to Trump's tariffsFollow us on:Download",
          "ET App:subscribe to our newsletterCopyright © 2025 Bennett, Coleman & Co. Ltd.",
          "All rights reserved. For reprint rights:Times Syndication Service"
        ]
      }
    ]
  }
]